app/Http/Controllers/BeritaController.php

select * from `berita` where `jenis` = 'berita' order by `created_at` desc
select * from `berita` where `jenis` = 'berita' order by `created_at` desc limit 1
---
    public function index()
    {
        $beritas = Berita::where('jenis', 'berita')->latest()->get();
        $beritaTerbaru = Berita::where('jenis', 'berita')->latest()->first();