app/Http/Controllers/HomeController.php

    public function index()
    {
        $beritas = Berita::where('jenis', 'berita')->latest()->take(3)->get();
        $artikels = Berita::where('jenis', 'artikel')->latest()->take(3)->get();
        $kepalaSekolah = StrukturSekolah::where('jabatan', 'Kepala Sekolah')->first();
        $kepalaPondok = StrukturSekolah::where('jabatan', 'Kepala Pondok')->first();
        $banners = Banner::latest()->take(3)->get();
---
select * from `berita` where `jenis` = 'berita' order by `created_at` desc limit 3
select * from `berita` where `jenis` = 'artikel' order by `created_at` desc limit 3
select * from `struktur_sekolah` where `jabatan` = 'Kepala Sekolah' limit 1
select * from `struktur_sekolah` where `jabatan` = 'Kepala Pondok' limit 1
select * from `banner` order by `created_at` desc limit 3